ranjithaguna/pv/LED_Demo/source/pic32cx/component/gpio_100_137.h
/** \brief GPIO_100_137 register API structure */
typedef struct
{  /* GPIO 100:137 Pin Control Registers */
  __IO  __GPIO_100_137_GPIO_100_PIN_CONTROL_bits_t GPIO_100_PIN_CONTROL; /**< Offset: 0x00 (R/W  32) GPIO100 Pin Control */
  __IO  __GPIO_100_137_GPIO_101_PIN_CONTROL_bits_t GPIO_101_PIN_CONTROL; /**< Offset: 0x04 (R/W  32) GPIO 101 Pin Control */
  __IO  __GPIO_100_137_GPIO_102_PIN_CONTROL_bits_t GPIO_102_PIN_CONTROL; /**< Offset: 0x08 (R/W  32) GPIO 102 Pin Control */
  __IO  __GPIO_100_137_GPIO_104_PIN_CONTROL_bits_t GPIO_104_PIN_CONTROL; /**< Offset: 0x10 (R/W  32) GPIO 104 Pin Control */
  __IO  __GPIO_100_137_GPIO_105_PIN_CONTROL_bits_t GPIO_105_PIN_CONTROL; /**< Offset: 0x14 (R/W  32) GPIO 105 Pin Control */
  __IO  __GPIO_100_137_GPIO_106_PIN_CONTROL_bits_t GPIO_106_PIN_CONTROL; /**< Offset: 0x18 (R/W  32) GPIO 106 Pin Control */
  __IO  __GPIO_100_137_GPIO_107_PIN_CONTROL_bits_t GPIO_107_PIN_CONTROL; /**< Offset: 0x1C (R/W  32) GPIO 107 Pin Control */
  __IO  __GPIO_100_137_GPIO_112_PIN_CONTROL_bits_t GPIO_112_PIN_CONTROL; /**< Offset: 0x28 (R/W  32) GPIO 112 Pin Control */
  __IO  __GPIO_100_137_GPIO_113_PIN_CONTROL_bits_t GPIO_113_PIN_CONTROL; /**< Offset: 0x2C (R/W  32) GPIO 113 Pin Control */
  __IO  __GPIO_100_137_GPIO_114_PIN_CONTROL_bits_t GPIO_114_PIN_CONTROL; /**< Offset: 0x30 (R/W  32) GPIO 114 Pin Control */
  __IO  __GPIO_100_137_GPIO_115_PIN_CONTROL_bits_t GPIO_115_PIN_CONTROL; /**< Offset: 0x34 (R/W  32) GPIO 115 Pin Control */
  __IO  __GPIO_100_137_GPIO_116_PIN_CONTROL_bits_t GPIO_116_PIN_CONTROL; /**< Offset: 0x38 (R/W  32) GPIO 116 Pin Control */
  __IO  __GPIO_100_137_GPIO_117_PIN_CONTROL_bits_t GPIO_117_PIN_CONTROL; /**< Offset: 0x3C (R/W  32) GPIO 117 Pin Control */
  __IO  __GPIO_100_137_GPIO_120_PIN_CONTROL_bits_t GPIO_120_PIN_CONTROL; /**< Offset: 0x40 (R/W  32) GPIO 120 Pin Control */
  __IO  __GPIO_100_137_GPIO_121_PIN_CONTROL_bits_t GPIO_121_PIN_CONTROL; /**< Offset: 0x44 (R/W  32) GPIO 121 Pin Control */
  __IO  __GPIO_100_137_GPIO_122_PIN_CONTROL_bits_t GPIO_122_PIN_CONTROL; /**< Offset: 0x48 (R/W  32) GPIO 122 Pin Control */
  __IO  __GPIO_100_137_GPIO_123_PIN_CONTROL_bits_t GPIO_123_PIN_CONTROL; /**< Offset: 0x4C (R/W  32) GPIO 123 Pin Control */
  __IO  __GPIO_100_137_GPIO_124_PIN_CONTROL_bits_t GPIO_124_PIN_CONTROL; /**< Offset: 0x50 (R/W  32) GPIO 124 Pin Control */
  __IO  __GPIO_100_137_GPIO_125_PIN_CONTROL_bits_t GPIO_125_PIN_CONTROL; /**< Offset: 0x54 (R/W  32) GPIO 125 Pin Control */
  __IO  __GPIO_100_137_GPIO_126_PIN_CONTROL_bits_t GPIO_126_PIN_CONTROL; /**< Offset: 0x58 (R/W  32) GPIO 126 Pin Control */
  __IO  __GPIO_100_137_GPIO_127_PIN_CONTROL_bits_t GPIO_127_PIN_CONTROL; /**< Offset: 0x5C (R/W  32) GPIO 127 Pin Control */
  __IO  __GPIO_100_137_GPIO_130_PIN_CONTROL_bits_t GPIO_130_PIN_CONTROL; /**< Offset: 0x60 (R/W  32) GPIO 130 Pin Control */
  __IO  __GPIO_100_137_GPIO_131_PIN_CONTROL_bits_t GPIO_131_PIN_CONTROL; /**< Offset: 0x64 (R/W  32) GPIO 131 Pin Control */
  __IO  __GPIO_100_137_GPIO_132_PIN_CONTROL_bits_t GPIO_132_PIN_CONTROL; /**< Offset: 0x68 (R/W  32) GPIO 132 Pin Control */
} gpio100137_registers_t;
/** @}  end of GPIO 100:137 Pin Control Registers */

#endif /* _PIC32CX_0525SG12_GPIO_100_137_COMPONENT_H_ */
